Configuration/Диплом/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокДоговоровБезАкта</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокАктов</name>
    <attributes>
      <name>ПериодАкта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументСсылка</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Configuration/Диплом/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

Configuration/Диплом/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Configuration/Диплом/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПроверкаАктовДлитльнаяОперация(Период, Адрес, Флаг) Экспорт   
	
	Попытка 
		Период.ДатаНачала = НачалоМесяца(Период.ДатаНачала);
		Период.ДатаОкончания = КонецМесяца(Период.ДатаОкончания); 
		
		Запрос = Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
		|	ДоговорыКонтрагентов.ВКМ_ПериодДействияДоговораНачало КАК ВКМ_ПериодДействияДоговораНачало,
		|	ДоговорыКонтрагентов.ВКМ_ПериодДействияДоговораОкончание КАК ВКМ_ПериодДействияДоговораОкончание
		|ПОМЕСТИТЬ ВТ_СправочникДоговоры
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И НАЧАЛОПЕРИОДА(ДоговорыКонтрагентов.ВКМ_ПериодДействияДоговораНачало, МЕСЯЦ) <= &ДатаНачало
		|	И КОНЕЦПЕРИОДА(ДоговорыКонтрагентов.ВКМ_ПериодДействияДоговораОкончание, МЕСЯЦ) >= &ДатаКонец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Документ,
		|	РеализацияТоваровУслуг.Организация КАК Организация,
		|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
		|	РеализацияТоваровУслуг.Договор КАК Договор,
		|	РеализацияТоваровУслуг.Дата КАК Дата
		|ПОМЕСТИТЬ ВТ_ДанныеДокументов
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачало И &ДатаКонец
		|	И РеализацияТоваровУслуг.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СправочникДоговоры.Договор КАК Договор,
		|	ВТ_СправочникДоговоры.Организация КАК Организация,
		|	ВТ_СправочникДоговоры.Контрагент КАК Контрагент,
		|	ВТ_ДанныеДокументов.Документ КАК ДокументСсылка
		|ИЗ
		|	ВТ_СправочникДоговоры КАК ВТ_СправочникДоговоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеДокументов КАК ВТ_ДанныеДокументов
		|		ПО ВТ_СправочникДоговоры.Организация = ВТ_ДанныеДокументов.Организация
		|			И ВТ_СправочникДоговоры.Контрагент = ВТ_ДанныеДокументов.Контрагент
		|			И ВТ_СправочникДоговоры.Договор = ВТ_ДанныеДокументов.Договор";
		
		Запрос.УстановитьПараметр("ДатаНачало",Период.ДатаНачала); 
		Запрос.УстановитьПараметр("ДатаКонец",Период.ДатаОкончания);
		Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.АбоненскоеОбслуживание);
		ВыборкаТЗ =  Запрос.Выполнить().Выгрузить();
		
		////{Заглушка для имитации длительной операции
		//Пауза = ТекущаяДатаСеанса()+ 10;//задержка на 10 сек
		//пока ТекущаяДатаСеанса()<= Пауза цикл
		//КонецЦикла;
		////}
		
		ПоместитьВоВременноеХранилище(ВыборкаТЗ, Адрес);
		
		Если Флаг = 0 Тогда
			Результат = "Проверка актов закончена.";
		Иначе
			Результат = "Формирование актов закончена.";
		КонецЕсли;
	Исключение
		Если Флаг = 0 Тогда  
			Результат = "При проверке актов возникли ошибки!"; 
		Иначе
			Результат = "При формировании актов возникли ошибки!";
		КонецЕсли;
		
	КонецПопытки;
	
	Возврат Результат; 
	
КонецФункции  

Функция ФормированиеАктовДлитльнаяОперация(Период, Адрес, МассивДоговоровБезАктов) Экспорт
	
	Отказ = Ложь;
	Попытка 
		Если МассивДоговоровБезАктов.Количество() = 0 Тогда  
			Отказ = Истина;
		КонецЕсли;
	Исключение
		Результат = "Тип значения параметра МассивДоговоровБезАктов не является массивом";
	КонецПопытки;
	
	Попытка 
		Для Каждого Договор из МассивДоговоровБезАктов Цикл
			
			НовыйРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();  
			
			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("Организация", Договор.Организация);
			ДанныеЗаполнения.Вставить("Контрагент", Договор.Владелец);
			ДанныеЗаполнения.Вставить("Договор",Договор);
			
			//НовыйРеализация.Дата = Период.ДатаНачала;
			НовыйРеализация.Дата = Период.ДатаОкончания;

			//НовыйРеализация.Организация = Договор.Организация; 
			//НовыйРеализация.Контрагент = Договор.Владелец;
			//НовыйРеализация.Договор = Договор;
			НовыйРеализация.Заполнить(ДанныеЗаполнения);
			
			НовыйРеализация.ВыполнитьАвтозаполнение();
			НовыйРеализация.ПроверитьЗаполнение();
			
			НовыйРеализация.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЦикла;	
		
		////{Заглушка для имитации длительной операции
		//Пауза = ТекущаяДатаСеанса()+ 10;//задержка на 10 сек
		//пока ТекущаяДатаСеанса()<= Пауза цикл
		//КонецЦикла;
		////}
		
		АктыСформированы =  ПроверкаАктовДлитльнаяОперация(Период, Адрес, 1);
		
		Результат = АктыСформированы;
		
	Исключение  
		Результат = "При формировании актов произошла ошибка!"; 
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции  

#КонецОбласти

#КонецЕсли
